doc/html/advanced/testing.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Automated Testing with Nitrogen</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Automated Testing with Nitrogen"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-01-29 17:28:13 CST"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="../stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Automated Testing with Nitrogen</h1>

<p><a href="http://nitrogenproject.com">Home</a> | <a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html">Elements</a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html">Handlers</a> | <a href="../config.html">Configuration Options</a> | <a href="../advanced.html"><b>Advanced Guides</b></a> | <a href="../troubleshooting.html">Troubleshooting</a> | <a href="../about.html">About</a>
</p>


<div class=headline>Automated Testing with Nitrogen</div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Overview</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">


<p>
  Nitrogen has a simple unit testing framework which runs on the server and in
  the browser, and can be used for testing the functionality of your
  application, ensuring that objects render properly in the browser, and that
  actions are wired in the browser appropriately.
</p>
<p>
  This means that currently, you need to be able to run it on a machine with a
  browser in it, or there is an option to initiate a test from an external
  browser.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> The testing system consists of three layers:</h3>
<div class="outline-text-3" id="text-1-1">



</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4"></span> 1. Individual Tests</h4>
<div class="outline-text-4" id="text-1-1-1">


<p>
    Each individual test is initiated by a call to one of the <code>?wf_test</code> macros
    and is used to test some simple cause and effect.
</p>
<p>
    There are a few different ways to initiate a test:
</p>
<dl>
<dt><code>?wf_test_auto(TestName, SetupFun, AssertionFun)</code></dt><dd>This is the most
      basic form of test. The test system will call <code>SetupFun()</code>, and what that
      completes, will automatically initiate a postback that will call
      <code>AssertionFun()</code>.  AssertionFun is expected to return <code>true</code>. Anything else
      will result in the test failing.

<p>
      An example that tests that a value was properly set in the browser might be:
</p>



<pre class="src src-erlang"><span class="org-function-name">tests</span>() -&gt;
  <span class="org-variable-name">SetupFun</span> = <span class="org-keyword">fun</span>() -&gt;<span class="org-function-name"> </span><span class="org-type">wf</span>:<span class="org-type">set</span>(my_textbox, <span class="org-string">"Value"</span>) <span class="org-keyword">end</span>,
  <span class="org-variable-name">AssertionFun</span> = <span class="org-keyword">fun</span>() -&gt;<span class="org-function-name"> </span><span class="org-type">wf</span>:<span class="org-type">q</span>(my_textbox) == <span class="org-string">"Value"</span> <span class="org-keyword">end</span>,
  ?<span class="org-constant">wf_test_manual</span>(set_textbox, <span class="org-variable-name">SetupFun</span>, <span class="org-variable-name">AssertionFun</span>).
</pre>


<p>
      If something is broken for some reason, (most common would be a typo in
      the name of the element), then <code>wf:q(my_textbox)</code> would not return the
      expected value, and the test would fail.
</p>
</dd>
<dt><code>?wf_test_manual(TestName, SetupFun, AssertionFun)</code></dt><dd>This is very
      similar to the <code>?wf_test_auto</code> test, except that the postback is not
      automatically executed.  Instead, you need to tell the test how to initiate
      the postback.  The easiest way would be with the <code>#event{}</code> or <code>#click{}</code>
      actions.

<p>
      An example of this might be to ensure that the expected postback is assigned to a button:
</p>



<pre class="src src-erlang"><span class="org-function-name">tests</span>() -&gt;
  <span class="org-variable-name">SetupFun</span> = <span class="org-keyword">fun</span>() -&gt;<span class="org-function-name"> </span><span class="org-type">wf</span>:<span class="org-type">wire</span>(my_button, #<span class="org-type">click</span>{}) <span class="org-keyword">end</span>,
  <span class="org-variable-name">AssertionFun</span> = undefined,
  ?<span class="org-constant">wf_test_manual</span>(button_works, <span class="org-variable-name">SetupFun</span>, <span class="org-variable-name">AssertionFun</span>)
</pre>


<p>
      And in the <code>event/1</code> function that <code>my_button</code> posts back to, you would add:
</p>



<pre class="src src-erlang">?<span class="org-constant">wf_test_event</span>(button_works)
</pre>


<p>
      Note that this is safe to include in your normal posbacks, since if the
      test is not running, this call will not do anything.
</p>
</dd>
<dt><code>?wf_test_js(TestName, SetupFun, JS, AssertionFun)</code></dt><dd>This test method
      allows you to collect arbitrary javascript properties (like if you want to
      verify that an element on the page has a certain height, or maybe that some
      global javascript variable has been set to a specific value).  The
      arguments are <b>very</b> similar, except for a few changes.

<ul>
<li><code>SetupFun</code> is exactly the same as in <code>?wf_test_manual</code> in that you do
        not need to execute a postback in it.
</li>
<li><code>JS</code> is a Javascript string that returns a value (the last call should
        be actuall have a <code>return</code> statement, as it's executed inside a javascript
        function). This value will be passed to the <code>AssertionFun</code> function.
</li>
<li><code>AssertionFun</code> is expected to be a function of arity 1, with the only
        argument being a list containing the return value(s) from <code>JS</code>.

</li>
</ul>

<p>      Here's an example to illustrate the usage.  Here we will add a <code>#panel</code>
      (which is just an HTML <code>div</code>), then verify that its width is greater than
      zero:
</p>



<pre class="src src-erlang">SetupFun = <span class="org-keyword">fun</span>() -&gt;<span class="org-function-name"> </span><span class="org-type">wf</span>:<span class="org-type">insert_top</span>(my_wrapper, #<span class="org-type">panel</span>{id=my_new_panel, text=<span class="org-string">"Hi Mom!"</span>} <span class="org-keyword">end</span>,
<span class="org-variable-name">JS</span> = <span class="org-string">"return objs('my_wrapper').width()"</span>,
<span class="org-variable-name">AssertFun</span> = <span class="org-keyword">fun</span>([<span class="org-variable-name">Width</span>]) -&gt;<span class="org-function-name"> </span><span class="org-builtin">is_integer</span>(<span class="org-variable-name">Width</span>) <span class="org-builtin">andalso</span> <span class="org-variable-name">Width</span> &gt; 0 <span class="org-keyword">end</span>,
?<span class="org-constant">wf_test_js</span>(element_added, <span class="org-variable-name">SetupFun</span>, <span class="org-variable-name">JS</span>, <span class="org-variable-name">AssertFun</span>).
</pre>

</dd>
</dl>



</div>

<div id="outline-container-1-1-1-1" class="outline-5">
<h5 id="sec-1-1-1-1"><span class="section-number-5"></span> Options</h5>
<div class="outline-text-5" id="text-1-1-1-1">


<p>
     There is an optional last argument that can be passed to each of these
     macros: A proplist containing options for <code>delay</code> and <code>timeout</code>
</p>
<dl>
<dt><code>delay</code> (<code>integer()</code>)</dt><dd>The number of milliseconds to wait before
       executing the <code>JS</code> term (if using <code>?wf_test_js</code>) or to wait before
       executing the postback (if using <code>?wf_test_auto</code> or <code>?wf_test_manual</code>).
       This would be used to allow a test to <i>process</i> before executing (say, an
       image may need to be downloaded, or some jquery-ui scripts will need to be
       run, or we need to wait for another postback to happen before getting the
       data).  This gives your script time to run before checking the value.

</dd>
<dt><code>timeout</code> (<code>integer()</code>)</dt><dd>The number of milliseconds the testing system
       is willing to wait for the test to complete before timing out.  This might
       be tripped if something is taking much longer than expected, or if
       javascript crashes and stops processing postbacks, or something else
       crashes.  It will just mean that the <code>?wf_test_event</code> macro was ultimately
       never called (which is done automatically if you're using <code>?wf_test_auto</code>
       or <code>?wf_test_js</code>).
</dd>
</dl>


</div>

</div>

<div id="outline-container-1-1-1-2" class="outline-5">
<h5 id="sec-1-1-1-2"><span class="section-number-5"></span> Other Ways to call the Test Macros</h5>
<div class="outline-text-5" id="text-1-1-1-2">


<p>
     There are actually several ways to call each of the <code>?wf_test</code> macros:
</p>
<ul>
<li><code>?wf_test_auto(TestName, SetupFun, AssertionFun)</code>
</li>
<li><code>?wf_test_auto(TestName, SetupFun, AssertionFun, Options)</code>
</li>
<li><code>?wf_test_auto(TestName, {SetupFun, AssertionFun})</code>
</li>
<li><code>?wf_test_auto(TestName, {SetupFun, AssertionFun, Options})</code>

</li>
<li><code>?wf_test_manual(TestName, SetupFun, AssertionFun)</code>
</li>
<li><code>?wf_test_manual(TestName, SetupFun, AssertionFun, Options)</code>
</li>
<li><code>?wf_test_manual(TestName, {SetupFun, AssertionFun})</code>
</li>
<li><code>?wf_test_manual(TestName, {SetupFun, AssertionFun, Options})</code>

</li>
<li><code>?wf_test_js(TestName, SetupFun, JS, AssertionFun)</code>
</li>
<li><code>?wf_test_js(TestName, SetupFun, JS, AssertionFun, Options)</code>
</li>
<li><code>?wf_test_js(TestName, {SetupFun, JS, AssertionFun})</code>
</li>
<li><code>?wf_test_js(TestName, {SetupFun, JS, AssertionFun, Options})</code>
</li>
</ul>


<p>     
     The reasoning for the alternative options of having the second argument be
     a tuple will be more obvious in the next section.
</p>
<p>
     Additionally, <code>SetupFun</code> and <code>AssertionFun</code> can be the atom <code>undefined</code>.
     If this is the case, <code>SetupFun</code> will do no setup (the equivilant of <code>fun()      -&gt; ok end</code>), and <code>AssertionFun</code> if set to <code>undefined</code> will simply return
     <code>true</code> (which you may do if all you wish to do is verify that a postback
     happened, without caring about the contents of the postback or the state
     of the application at the time of the postback).
</p>
</div>
</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4"></span> 2. Test Pages</h4>
<div class="outline-text-4" id="text-1-1-2">


<p>  
    A test page allows for a collection of tests to be run, and the results of
    each test gets aggregated on a per-page basis.
</p>
<p>
    Starting a page test consists of calling <code>wf_test:start(TestFuns)</code>, where
    <code>TestFun</code> is a function that consists of a series of <code>?wf_test_X()</code> calls
    along with any additional setup or teardown for the tests.
</p>

</div>

<div id="outline-container-1-1-2-1" class="outline-5">
<h5 id="sec-1-1-2-1"><span class="section-number-5"></span> A page dedicated to tests:</h5>
<div class="outline-text-5" id="text-1-1-2-1">


<p>
     A simple example would be to call <code>wf_test:start/1</code> in your page module's
     <code>main()</code> function.
</p>



<pre class="src src-erlang"><span class="org-function-name">main</span>() -&gt;<span class="org-function-name"> </span>
  <span class="org-type">wf_test</span>:<span class="org-type">start</span>(<span class="org-keyword">fun</span> <span class="org-type">tests/0</span>),
  #<span class="org-type">template</span>{file=<span class="org-string">"mytemplate.html"</span>}.

...

<span class="org-function-name">event</span>(my_test_manual) -&gt;
  ?<span class="org-constant">wf_test_event</span>(my_test_manual).

<span class="org-function-name">tests</span>() -&gt;
  ?<span class="org-constant">wf_test_auto</span>(my_test, <span class="org-type">my_test</span>()),
  ?<span class="org-constant">wf_test_manual</span>(my_other_test, <span class="org-type">my_manual_test</span>()).

<span class="org-function-name">my_test</span>() -&gt;
  {
    <span class="org-keyword">fun</span>() -&gt;<span class="org-function-name"> </span><span class="org-type">wf</span>:<span class="org-type">set</span>(textbox, <span class="org-string">"NewVal"</span>) <span class="org-keyword">end</span>,
    <span class="org-keyword">fun</span>() -&gt;<span class="org-function-name"> </span><span class="org-type">wf</span>:<span class="org-type">q</span>(textbox) == <span class="org-string">"NewVal"</span>
  }.

<span class="org-function-name">my_test_manual</span>() -&gt;
  {
    <span class="org-keyword">fun</span>() -&gt;
      <span class="org-type">wf</span>:<span class="org-type">insert_after</span>(textbox, #<span class="org-type">button</span>{postback=my_test_manual, id=mybutton}),
      <span class="org-type">wf</span>:<span class="org-type">wire</span>(mybutton, #<span class="org-type">click</span>{})
    <span class="org-keyword">end</span>,
    undefined <span class="org-comment-delimiter">%% </span><span class="org-comment">We just want to verify that the postback worked.</span>
  }.
</pre>


</div>

</div>

<div id="outline-container-1-1-2-2" class="outline-5">
<h5 id="sec-1-1-2-2"><span class="section-number-5"></span> Adding Tests to an existing page</h5>
<div class="outline-text-5" id="text-1-1-2-2">


<p>
     If you have an existing page on which you would like to conduct tests
     without cluttering up the module's page, instead building all the tests on
     a separate module. You can do this with <code>wf_test:start_other(ModuleName, TestFun)</code>.
</p>
<p>
     For example, say we want to test a module called <code>my_module</code> by creating a
     module called <code>test_module</code>:
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span>(test_module).
<span class="org-preprocessor">-compile</span>(export_all).
<span class="org-preprocessor">-include_lib</span>(<span class="org-string">"nitrogen_core/include/wf.hrl"</span>).

<span class="org-function-name">main</span>() -&gt;<span class="org-function-name"> </span><span class="org-type">wf_test</span>:<span class="org-type">start_other</span>(my_module, <span class="org-keyword">fun</span> <span class="org-type">tests/0</span>).

<span class="org-function-name">tests</span>() -&gt;
  ?<span class="org-constant">wf_test_js</span>(fill_form, <span class="org-type">fill_form</span>()).

<span class="org-function-name">fill_form</span>() -&gt;
  {
    <span class="org-keyword">fun</span>() -&gt;
      <span class="org-type">wf</span>:<span class="org-type">set</span>(first_name, <span class="org-string">"Jesse"</span>),
      <span class="org-type">wf</span>:<span class="org-type">set</span>(last_name, <span class="org-string">"Gumm"</span>),
      <span class="org-type">wf</span>:<span class="org-type">wire</span>(button, #<span class="org-type">click</span>{})
    <span class="org-keyword">end</span>,
    <span class="org-string">"return objs('confirmation').text()"</span>,
    <span class="org-keyword">fun</span>([<span class="org-variable-name">Text</span>]) -&gt;
      <span class="org-variable-name">Text</span> == <span class="org-string">"Thank you for your submission"</span>
    <span class="org-keyword">end</span>,
    [{delay, 500}]
  }.
</pre>


<p>
     This will load the <code>my_module</code> page, starting the tests in the process.
</p>
</div>
</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4"></span> 3. Chain of pages</h4>
<div class="outline-text-4" id="text-1-1-3">


<p>
    The overarching implementation of the tests for an application is almost
    completely done in configurations.
</p>
<p>
    There are two configuration options you want to add to your <code>app.config</code>
    file: <code>test_browsers</code> and <code>tests</code>.
</p>
<ul>
<li><code>test_browsers</code> is a list of browsers in which to test your app.
</li>
<li><code>tests</code> which is a list of paths to test.
</li>
</ul>





<pre class="src src-erlang">{test_browsers, [
  <span class="org-string">"google-chrome"</span>,
  <span class="org-string">"firefox"</span>
]},
{tests, [
  <span class="org-string">"/path/to/test"</span>,
  <span class="org-string">"/path/to/other_test"</span>
]},
</pre>


<p>
    Once this is set up, you'll want to run <code>wf_test:start_all(AppName)</code> (where
    AppName, with the default setup is <code>nitrogen</code>).  This will launch all tests
    listed in the <code>tests</code> app var in order, and in each browser listed in
    <code>test_browsers</code>.
</p>
<p>
    If there is an <code>undefined</code> specified in <code>test_browsers</code>, then it will not
    open a browser, but instead expect you to load a specific URL in the
    browser of your choice to launch the tests.
</p></div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-01-29 17:28:13 CST</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/advanced/testing.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
